---
kind: method
id: M:Autodesk.Revit.DB.KeyBasedTreeEntryError.GetEntry
source: html/7f9bd2d3-5af0-1aad-95ce-f754ff98b84a.htm
---
# Autodesk.Revit.DB.KeyBasedTreeEntryError.GetEntry Method

Gets the entry for which an error occurred while building the KeyBasedTreeEntries object.

## Syntax (C#)
```csharp
public KeyBasedTreeEntry GetEntry()
```

## Returns
A copy of the KeyBasedTreeEntry.